#include <iostream>

int main()
{
	std::cout << "hello world" << std::endl;
	std::cout << "hello world" << std::endl;
	std::cout << "hello wor\bld" << std::endl;
	return 10;
}

/*
\'   - вивід одинарної лапки (застаріла, уже просто так можна виводити одинарну лапку).
\?   - оминання триграфів. (застаріло).
\"   - вивід подвійної лапки.
\\   - вивід оберненої риски.
\a   - проігрування одинарного системного звуку (в сучасних комп 'ютерах просто грає звук
	   системного повідомлення).
\b   - переніс курсору на 1 позицію вліво. Ця послідовність являється клавішою backspace.
\f   - переніс курсору на нову сторінку (використовується в друці).
\n   - переніс курсору на наступний рядок. Ця послідовність являється клавішою Enter.
\r   - переніс курсору на початок даного рядка.
\t   - переніс курсору на наступну горизонтальну табуляцію. Ця послідовність являється клавішою
	   Tab.
\v   - переніс курсору на наступну вертикальну табуляцію. (використовується в друці).
\0цц - вивід символу по його коду y 8-ковій системі числення (ц - цифра).
\Хцц - вивід символу по його коду y 16-ковій системі числення (ц - цифра).
\Uцц - вивід символу по його коду y таблиці кодування Unicode (ц - цифра).
*/